In [1]:
# DateFrames Part 2
# conditional selection

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [7]:
np.random.seed(101)

In [ ]:
# Creating a dataframe of 5 rows and 4 columns

In [5]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df > 0                              # conditional selection using operator

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [12]:
booldf = df > 0

In [13]:
booldf                      # getting boolean output

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [14]:
df[booldf]              #passing  boolean dataframe to  orignal dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df['W']> 0                # for a selected column

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [18]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [19]:
df[df['W']>0]            # No NULL values( all rows whose values are True i.e greater than 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [21]:
resultdf = df[df['W']>0]                   # method 1

In [23]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [25]:
df[df['W']>0][['X','Y']]                        # method 2

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [26]:
boolser = df['W']>0                         # breaking instructions into parts
result = df[boolser]

In [27]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [28]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
result[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [32]:
df[(df['W']>0) & (df['X']<1)]                       # using ANd operator = &

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [33]:
df[(df['W']>0) | (df['X'])]                       # USING OR opertor  |

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df                                      # using df.reset_index(implace = True) to reset orignal dataframe

   level_0 index         W         X         Y         Z
0        0     A  2.706850  0.628133  0.907969  0.503826
1        1     B  0.651118 -0.319318 -0.848077  0.605965
2        2     C -2.018168  0.740122  0.528813 -0.589001
3        3     D  0.188695 -0.758872 -0.933237  0.955057
4        4     E  0.190794  1.978757  2.605967  0.683509

In [49]:
newind ='CA NY WY OR CO'.split()

In [51]:
newind                                 # creating a list

['CA', 'NY', 'WY', 'OR', 'CO']

In [52]:
df['STATES'] = newind                  # creating a new column in dataframe

In [53]:
df

   level_0 index         W         X         Y         Z STATES
0        0     A  2.706850  0.628133  0.907969  0.503826     CA
1        1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2        2     C -2.018168  0.740122  0.528813 -0.589001     WY
3        3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4        4     E  0.190794  1.978757  2.605967  0.683509     CO

In [54]:
df.set_index('STATES')                            # forming new index

        level_0 index         W         X         Y         Z
STATES
CA            0     A  2.706850  0.628133  0.907969  0.503826
NY            1     B  0.651118 -0.319318 -0.848077  0.605965
WY            2     C -2.018168  0.740122  0.528813 -0.589001
OR            3     D  0.188695 -0.758872 -0.933237  0.955057
CO            4     E  0.190794  1.978757  2.605967  0.683509

In [55]:
df                                                # orignal df remains unchanged

   level_0 index         W         X         Y         Z STATES
0        0     A  2.706850  0.628133  0.907969  0.503826     CA
1        1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2        2     C -2.018168  0.740122  0.528813 -0.589001     WY
3        3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4        4     E  0.190794  1.978757  2.605967  0.683509     CO